app/Controllers/NewPost.php

INSERT INTO `posts` (`content`, `email`, `tags`, `image_path`) VALUES ('111', 'abc@abc.com', 'tag,212', 'assets/uploads/1715473751_f4201fe5c9d9bc9ccce0.png')
---
        // $img->move(ROOTPATH.'public/assets/uploads/', $fileName);
        // $data = ['uploaded_fileinfo' => new File($filepath)];

        $model->save([
            'content'  => $post['content'],
            'email' => $post['email'],
            'tags' => $post['tags'],
            'image_path' => 'assets/uploads/'.$imageName,
        ]);