app/Models/PostModel.php

SELECT *
FROM `posts`
---
    public function getPostByDiv(int $page = 1)
    {
        $posts = $this->findAll();    // get all posts

SELECT *
FROM `posts`
---
    public function getTop5Post()
    {
        $posts = $this->findAll();    // get all posts